Revit 2015 API
IncompatibleOperationChoice Enumeration
 The options are used by the CloudSharedLocalIncompatibleEventArgs.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public enum IncompatibleOperationChoice
Visual Basic
Public Enumeration IncompatibleOperationChoice
Visual C++
public enum class IncompatibleOperationChoice
Members
Member name | Description
OpenLocal
DiscardChangesAndOpenLatest
SaveChanges
DiscardChanges
Cancel
See Also
Autodesk.Revit.DB.Events Namespace